MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4KQFYFG/mcu.h
#define TSB_EN2_TNCR_ZEACT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,5)))
#define TSB_EN2_TNCR_ENRUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,6)))
#define TSB_EN2_TNCR_ZEN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,7)))
#define TSB_EN2_TNCR_ENCLR                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,10)))
#define TSB_EN2_TNCR_SFTCAP                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,11)))
#define TSB_EN2_TNCR_TRGCAPMD                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,12)))
#define TSB_EN2_TNCR_P3EN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,16)))
#define TSB_EN2_TNCR_SDTEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,21)))
#define TSB_EN2_TNCR_MCMPMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,24)))
#define TSB_EN2_TNCR_TOVMD                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,25)))
#define TSB_EN2_TNCR_CMPSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->TNCR,28)))
#define TSB_EN2_STS_INERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,0)))
#define TSB_EN2_STS_PDERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,1)))
#define TSB_EN2_STS_SKPDT                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,2)))
#define TSB_EN2_STS_ZDET                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,12)))
#define TSB_EN2_STS_UD                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,13)))
#define TSB_EN2_STS_REVERR                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->STS,14)))
#define TSB_EN2_INPCR_SYNCSPLEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INPCR,0)))
#define TSB_EN2_INPCR_SYNCSPLMD                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INPCR,1)))
#define TSB_EN2_INPCR_SYNCNCZEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INPCR,2)))
#define TSB_EN2_INPCR_PDSTT                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_EN2->INPCR,6)))
#define TSB_EN2_INPCR_PDSTP                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_EN2->INPCR,7)))
#define TSB_EN2_INPMON_SPLMONA                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,0)))
#define TSB_EN2_INPMON_SPLMONB                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,1)))
#define TSB_EN2_INPMON_SPLMONZ                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,2)))
#define TSB_EN2_INPMON_DETMONA                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,4)))
#define TSB_EN2_INPMON_DETMONB                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,5)))
#define TSB_EN2_INPMON_DETMONZ                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INPMON,6)))
#define TSB_EN2_INTCR_TPLSIE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,0)))
#define TSB_EN2_INTCR_CAPIE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,1)))
#define TSB_EN2_INTCR_ERRIE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,2)))
#define TSB_EN2_INTCR_CMPIE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,3)))
#define TSB_EN2_INTCR_RLDIE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,4)))
#define TSB_EN2_INTCR_MCMPIE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EN2->INTCR,5)))
#define TSB_EN2_INTF_TPLSF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,0)))
#define TSB_EN2_INTF_CAPF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,1)))
#define TSB_EN2_INTF_ERRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,2)))
#define TSB_EN2_INTF_INTCPF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,3)))
#define TSB_EN2_INTF_RLDCPF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,4)))
#define TSB_EN2_INTF_MCMPF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EN2->INTF,5)))


/* Advanced Vector Engine Plus (A-VE+) */
#define TSB_VE0_EN_VEEN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->EN,0)))
#define TSB_VE0_ERRINTEN_VERREN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->ERRINTEN,0)))
#define TSB_VE0_ERRINTEN_INTTEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->ERRINTEN,2)))
#define TSB_VE0_SCHTASKRUN_VRSCH                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_VE0->SCHTASKRUN,0)))
#define TSB_VE0_MCTLF_LAVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,0)))
#define TSB_VE0_MCTLF_LAVFM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,1)))
#define TSB_VE0_MCTLF_LVTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,2)))
#define TSB_VE0_MCTLF_PLSLF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,4)))
#define TSB_VE0_MCTLF_PLSLFM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,5)))
#define TSB_VE0_MCTLF_PIDOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,8)))
#define TSB_VE0_MCTLF_PIQOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,9)))
#define TSB_VE0_MCTLF_VSOVF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,10)))
#define TSB_VE0_MCTLF_PWMOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,11)))
#define TSB_VE0_MCTLF_SFT2ST                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,14)))
#define TSB_VE0_MCTLF_SFT2STM                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,15)))
#define TSB_VE0_MODE_PVIEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,0)))
#define TSB_VE0_MODE_ZIEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,1)))
#define TSB_VE0_MODE_VDCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,4)))
#define TSB_VE0_MODE_CLPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,7)))
#define TSB_VE0_MODE_T5ECEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,10)))
#define TSB_VE0_MODE_NICEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,11)))
#define TSB_VE0_MODE_PWMBLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,12)))
#define TSB_VE0_MODE_PWMFLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,13)))
#define TSB_VE0_MODE_PMDDTCEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,14)))
#define TSB_VE0_MODE_IPDEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,15)))
#define TSB_VE0_FMODE_C2PEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,0)))
#define TSB_VE0_FMODE_SPWMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,1)))
#define TSB_VE0_FMODE_IDQSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,4)))
#define TSB_VE0_FMODE_IAPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,5)))
#define TSB_VE0_FMODE_IBPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,6)))
#define TSB_VE0_FMODE_ICPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,7)))
#define TSB_VE0_FMODE_CRCEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,8)))
#define TSB_VE0_FMODE_MREGDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,9)))
#define TSB_VE0_FMODE_PHCVDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,12)))
#define TSB_VE0_FMODE_CCVMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,13)))
#define TSB_VE0_OUTCR_UPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,6)))
#define TSB_VE0_OUTCR_VPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,7)))
#define TSB_VE0_OUTCR_WPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,8)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM4KQ_H__ */

/** @} */ /* End of group TMPM4KQ */
/** @} */ /* End of group TOSHIBA_TXZ_MICROCONTROLLER */
